RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
      // Disable Reset Vector Catch in DEMCR
      value = Read32(DEMCR_Addr);
      Write32(DEMCR_Addr, (value &amp; (~0x00000001)));

      //Clear BP0 and FPB
      Write32(0xE0002008, 0);                         // Clear BP0
      Write32(0xE0002000, 0x00000002);                // Disable FPB
    </block>
          </sequence>
          <sequence name="ResetSystem">
            <block>
      // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
      __var SCS_Addr   = 0xE000E000;
      __var AIRCR_Addr = SCS_Addr + 0xD0C;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;

      __errorcontrol = 0x1;     // Skip errors, write to AIRCR.SYSRESETREQ may not be able to finish with OK response

      // Execute SYSRESETREQ via AIRCR
      Write32(AIRCR_Addr, 0x05FA0004);

      __errorcontrol = 0x0;     // Honor errors again

      DAP_Delay(20000);         // Delay of 20ms to let reset finish. Otherwise access to DHCSR can fail with too fast debug units.
    </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
          </sequence>
        </sequences>
        <memory name="ROMCP" start="0x00200000" size="0x020000" access="rx" default="1"/>
        <memory name="SRAM_DTC" start="0x20000000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_ITC" start="0x00000000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_OC" start="0x20280000" size="0x040000" access="rw" default="1"/>
        <memory name="SRAM_OC2" start="0x20200000" size="0x080000" access="rw" default="1"/>
        <algorithm name="devices/MIMXRT1062/arm/MIMXRT106x_QSPI_4KB_SEC.FLM" start="0x60000000" size="0x00800000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <algorithm name="devices/MIMXRT1062/arm/MIMXRT106x_16MB_QSPI_4KB_SEC.FLM" start="0x60000000" size="0x01000000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <debug svd="devices/MIMXRT1062/MIMXRT1062.xml"/>
        <variant Dvariant="MIMXRT1062DVL6B">
          <compile header="devices/MIMXRT1062/fsl_device_registers.h" define="CPU_MIMXRT1062DVL6B"/>
        </variant>
        <variant Dvariant="MIMXRT1062CVL5B">
          <compile header="devices/MIMXRT1062/fsl_device_registers.h" define="CPU_MIMXRT1062CVL5B"/>
        </variant>
        <variant Dvariant="MIMXRT1062CVJ5B">
          <compile header="devices/MIMXRT1062/fsl_device_registers.h" define="CPU_MIMXRT1062CVJ5B"/>
        </variant>
        <variant Dvariant="MIMXRT1062DVJ6B">
          <compile header="devices/MIMXRT1062/fsl_device_registers.h" define="CPU_MIMXRT1062DVJ6B"/>
        </variant>
        <variant Dvariant="MIMXRT1062DVN6B">
          <compile header="devices/MIMXRT1062/fsl_device_registers.h" define="CPU_MIMXRT1062DVN6B"/>
        </variant>
        <variant Dvariant="MIMXRT1062XVN5B">
          <compile header="devices/MIMXRT1062/fsl_device_registers.h" define="CPU_MIMXRT1062XVN5B"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <accept Dname="MIMXRT1062CVJ5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVJ5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVN6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062XVN5B" Dvendor="NXP:11"/>
    </condition>
    <condition id="DEVICES_Project_Template.MIMXRT1062.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, device.MIMXRT1062_startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.lpuart, driver.nic301, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, device.MIMXRT1062_startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.lpuart, driver.nic301, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iomuxc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="nic301"/>
      <require condition="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, utility.assert, utility.debug_console.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, utility.assert, utility.debug_console.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device_ids.MIMXRT1062xxxxA.internal_condition">
      <accept Dname="MIMXRT1062CVJ5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6A" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.device_ids=MIMXRT1062xxxxA.condition_id">
      <require condition="device_ids.MIMXRT1062xxxxA.internal_condition"/>
    </condition>
    <condition id="device_ids.MIMXRT1062xxxxB.internal_condition">
      <accept Dname="MIMXRT1062CVJ5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVN6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062XVN5B" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.device_ids=MIMXRT1062xxxxB.condition_id">
      <require condition="device_ids.MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="RTE_Device.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.edma.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.edma.internal_condition">
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MIMXRT1062.internal_condition">
      <accept Dname="MIMXRT1062CVJ5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVJ5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVN6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062XVN5B" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.device=MIMXRT1062.internal_condition">
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_edma_adapter.condition_id">
      <require condition="allOf.driver.common, driver.sai_edma, device=MIMXRT1062.internal_condition"/>
    </condition>
