RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="allOf.driver.common, driver.sai_edma, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.igpio_adapter, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.timer_manager, anyOf=component.igpio_adapter, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.component.igpio_adapter.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.component.igpio_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="igpio_adapter"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="anyOf.allOf=driver.codec, component.wm8904_adapter, allOf=driver.codec, component.wm8960_adapter, allOf=driver.codec, component.wm8962_adapter, allOf=driver.codec, component.sgtl_adapter, allOf=driver.codec, component.da7212_adapter, allOf=driver.codec, component.cs42888_adapter, allOf=driver.common, component.cs42448_adapter.internal_condition"/>
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.codec, component.wm8904_adapter, allOf=driver.codec, component.wm8960_adapter, allOf=driver.codec, component.wm8962_adapter, allOf=driver.codec, component.sgtl_adapter, allOf=driver.codec, component.da7212_adapter, allOf=driver.codec, component.cs42888_adapter, allOf=driver.common, component.cs42448_adapter.internal_condition">
      <accept condition="allOf.driver.codec, component.wm8904_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.wm8960_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.wm8962_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.sgtl_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.da7212_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.cs42888_adapter.internal_condition"/>
      <accept condition="allOf.driver.common, component.cs42448_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.codec, component.wm8904_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.wm8960_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.wm8962_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.sgtl_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.da7212_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.cs42888_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
    </condition>
    <condition id="allOf.driver.common, component.cs42448_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.driver.common, anyOf=component.lpi2c_adapter, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, anyOf=component.lpi2c_adapter, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="anyOf.component.lpi2c_adapter.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.component.lpi2c_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_adapter"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.driver.cs42448, driver.codec, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.cs42448, driver.codec, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.driver.cs42888, driver.codec, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.cs42888, driver.codec, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.driver.dialog7212, driver.codec, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dialog7212, driver.codec, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.exception_handling_cm7.condition_id">
      <require condition="allOf.driver.common, utility.debug_console, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.debug_console, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm7f.condition_id">
      <require condition="cores.cm7f.internal_condition"/>
    </condition>
    <condition id="cores.cm7f.internal_condition">
      <accept Dcore="Cortex-M7"/>
    </condition>
    <condition id="device.MIMXRT1061.internal_condition">
      <accept Dname="MIMXRT1061CVJ5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061DVJ6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061CVJ5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061CVL5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061DVJ6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061DVL6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1061XVN5B" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.flexspi_nor_flash_adapter_rt1060.condition_id">
      <require condition="allOf.board=evkmimxrt1060, driver.common, driver.flexspi, device=MIMXRT1062.internal_condition"/>
    </condition>
