RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="allOf.board=evkmimxrt1060, driver.common, driver.flexspi, device=MIMXRT1062.internal_condition">
      <require condition="board.evkmimxrt1060.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="board.evkmimxrt1060.internal_condition">
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.flexspi_nor_flash_adapter_rt1060evkb.condition_id">
      <require condition="allOf.board=evkbmimxrt1060, driver.common, driver.flexspi, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkbmimxrt1060, driver.common, driver.flexspi, device=MIMXRT1062.internal_condition">
      <require condition="board.evkbmimxrt1060.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="board.evkbmimxrt1060.internal_condition">
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.gpt_adapter.condition_id">
      <require condition="allOf.driver.common, driver.gpt, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.gpt, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpt"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.gpt_time_stamp_adapter.condition_id">
      <require condition="allOf.board=evkmimxrt1060, evkbmimxrt1060, evkcmimxrt1060, driver.common, driver.gpt, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkmimxrt1060, evkbmimxrt1060, evkcmimxrt1060, driver.common, driver.gpt, device=MIMXRT1062.internal_condition">
      <require condition="board.evkmimxrt1060, evkbmimxrt1060, evkcmimxrt1060.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpt"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="board.evkmimxrt1060, evkbmimxrt1060, evkcmimxrt1060.internal_condition">
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.igpio_adapter.condition_id">
      <require condition="allOf.driver.igpio, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.igpio, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.igpio_adapter, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole_lite.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console_lite, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console_lite, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.driver.common, component.log, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
