RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="component.lpi2c_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpi2c, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpi2c, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.lpspi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpspi, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpspi, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpuart, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpuart, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.lpuart_dma_adapter.condition_id">
      <require condition="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_edma, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_edma, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.driver.lpuart_edma.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart_edma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.driver.common, component.lists, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.messaging.condition_id">
      <require condition="allOf.driver.common, component.lists, component.mem_manager_light, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, component.mem_manager_light, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.mflash.common.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.mflash.evkcmimxrt1060.condition_id">
      <require condition="allOf.component.mflash.common, board=evkcmimxrt1060, driver.flexspi, driver.cache_armv7_m7, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.component.mflash.common, board=evkcmimxrt1060, driver.flexspi, driver.cache_armv7_m7, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_common"/>
      <require condition="board.evkcmimxrt1060.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="board.evkcmimxrt1060.internal_condition">
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.mflash.rt1060.condition_id">
      <require condition="allOf.component.mflash.common, board=evkmimxrt1060, evkbmimxrt1060, driver.flexspi, driver.cache_armv7_m7, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.component.mflash.common, board=evkmimxrt1060, evkbmimxrt1060, driver.flexspi, driver.cache_armv7_m7, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_common"/>
      <require condition="board.evkmimxrt1060, evkbmimxrt1060.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="board.evkmimxrt1060, evkbmimxrt1060.internal_condition">
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
      <accept condition="device.MIMXRT1061.internal_condition"/>
      <accept condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.mflash_dummy.condition_id">
      <require condition="allOf.component.mflash_file, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.component.mflash_file, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_file"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.mflash_file.condition_id">
      <require condition="anyOf.component.mflash.rt1060, component.mflash.evkcmimxrt1060.internal_condition"/>
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
