RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="anyOf.component.mflash.rt1060, component.mflash.evkcmimxrt1060.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="rt1060"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="evkcmimxrt1060"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.common, driver.pit, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.pit, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.pit_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.common, driver.pit, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.component.serial_manager, anyOf=allOf=driver.lpspi, component.lpspi_adapter, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, anyOf=allOf=driver.lpspi, component.lpspi_adapter, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.allOf=driver.lpspi, component.lpspi_adapter.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, component.lpspi_adapter.internal_condition">
      <accept condition="allOf.driver.lpspi, component.lpspi_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, component.lpspi_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.core=cm7f, driver.common, component.serial_manager, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm7f, driver.common, component.serial_manager, device=MIMXRT1062.internal_condition">
      <require condition="core.cm7f.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="core.cm7f.internal_condition">
      <accept Dcore="Cortex-M7"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, component.serial_manager, anyOf=driver.lpuart, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, component.serial_manager, anyOf=driver.lpuart, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.driver.sgtl5000, driver.codec, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sgtl5000, driver.codec, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.silicon_id.condition_id">
      <require condition="anyOf.allOf=driver.common, component.silicon_id_rt10xx.internal_condition"/>
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.common, component.silicon_id_rt10xx.internal_condition">
      <accept condition="allOf.driver.common, component.silicon_id_rt10xx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.silicon_id_rt10xx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt10xx"/>
    </condition>
    <condition id="component.silicon_id_rt10xx.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, component.silicon_id.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, component.silicon_id.internal_condition">
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
