RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.gpt_adapter, component.pit_adapter, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.gpt_adapter, component.pit_adapter, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.gpt_adapter, component.pit_adapter.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.component.gpt_adapter, component.pit_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpt_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
    </condition>
    <condition id="component.trng_adapter.condition_id">
      <require condition="allOf.driver.common, driver.trng, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.trng, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.config.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.driver.wm8904, driver.codec, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.wm8904, driver.codec, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.driver.wm8960, driver.codec, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.wm8960, driver.codec, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.driver.wm8962, driver.codec, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.wm8962, driver.codec, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="device.MIMXRT1062_CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="device.MIMXRT1062_linker.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="device_ids.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <accept Dname="MIMXRT1062CVJ5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVJ5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062CVL5B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVJ6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVL6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062DVN6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1062XVN5B" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.MIMXRT1062_startup.condition_id">
      <require condition="allOf.device.MIMXRT1062_system, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.device.MIMXRT1062_system, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062_system"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
