RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.MIMXRT1062_system.condition_id">
      <require condition="allOf.device.MIMXRT1062_CMSIS, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.device.MIMXRT1062_CMSIS, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062_header"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.adc_12b1msps_sar.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition">
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.adc_etc.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.aipstz.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.aoi.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.bee.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cache_armv7_m7.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.camera-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-common.condition_id">
      <require condition="allOf.driver.camera-common, driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-common, driver.common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-mt9m114.condition_id">
      <require condition="allOf.driver.video-common, driver.camera-common, driver.camera-device-common, driver.video-i2c, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, driver.camera-common, driver.camera-device-common, driver.video-i2c, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7725.condition_id">
      <require condition="allOf.driver.video-common, driver.camera-common, driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, driver.camera-common, driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-sccb.condition_id">
      <require condition="allOf.driver.common, anyOf=driver.lpi2c, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, anyOf=driver.lpi2c, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpi2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="driver.camera-receiver-common.condition_id">
      <require condition="allOf.driver.video-common, driver.camera-common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, driver.camera-common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.camera-receiver-csi.condition_id">
      <require condition="allOf.driver.video-common, driver.camera-common, driver.camera-receiver-common, driver.csi, device=MIMXRT1062.internal_condition"/>
    </condition>
