RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="allOf.driver.video-common, driver.camera-common, driver.camera-receiver-common, driver.csi, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-receiver-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="csi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.cmp.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_enet.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.enet, CMSIS_Driver_Include.Ethernet_MAC, CMSIS_Driver_Include.Ethernet_PHY, CMSIS_Driver_Include.Ethernet, RTE_Device, driver.phy-common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.enet, CMSIS_Driver_Include.Ethernet_MAC, CMSIS_Driver_Include.Ethernet_PHY, CMSIS_Driver_Include.Ethernet, RTE_Device, driver.phy-common.internal_condition">
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="enet"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.2.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Capiversion="2.2.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.driver.lpi2c_edma, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.lpi2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c_edma, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.lpi2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.driver.lpspi_edma, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.lpspi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi_edma, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.lpspi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.driver.lpuart_edma, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart_edma, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.driver.common, anyOf=component.wm8904_adapter, component.wm8960_adapter, component.wm8962_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.cs42448_adapter, component.codec_adapters, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, anyOf=component.wm8904_adapter, component.wm8960_adapter, component.wm8962_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.cs42448_adapter, component.codec_adapters, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="anyOf.component.wm8904_adapter, component.wm8960_adapter, component.wm8962_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.cs42448_adapter, component.codec_adapters.internal_condition"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wm8904_adapter, component.wm8960_adapter, component.wm8962_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.cs42448_adapter, component.codec_adapters.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.clock, device.MIMXRT1062_CMSIS, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.clock, device.MIMXRT1062_CMSIS, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062_header"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.cs42448.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.codec_i2c, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
