RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.csi.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-elcdif.condition_id">
      <require condition="allOf.driver.dc-fb-common, driver.elcdif, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dc-fb-common, driver.elcdif, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="elcdif"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.dcdc_1.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dcp.condition_id">
      <require condition="allOf.driver.cache_armv7_m7, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.driver.cache_armv7_m7, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common, driver.dmamux.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common, driver.dmamux.internal_condition">
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="driver.elcdif.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.enc.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.enet.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ewm.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexcan.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexcan_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexcan, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexcan, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexio_camera.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexio_camera_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_camera, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_camera, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_camera"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device=MIMXRT1062.internal_condition"/>
    </condition>
