RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="driver.flexio_i2s_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_i2s, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_i2s, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_mculcd, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_mculcd, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_spi, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_spi, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_uart, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_uart, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.flexram.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common, driver.soc_flexram_allocate.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common, driver.soc_flexram_allocate.internal_condition">
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_flexram_allocate"/>
    </condition>
    <condition id="driver.flexspi.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexspi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexspi, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexspi, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.ft5406_rt.condition_id">
      <require condition="allOf.driver.lpi2c, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MIMXRT1062.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.gpc_1.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.gpt.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.igpio.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.iomuxc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.kpp.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
