RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpi2c, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpi2c, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpspi, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpspi, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpuart, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpuart, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.nand_flash-common.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.nand_flash-controller-flexspi.condition_id">
      <require condition="allOf.driver.nand_flash-common, driver.flexspi, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.nand_flash-common, driver.flexspi, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.nand_flash-controller-semc.condition_id">
      <require condition="allOf.driver.nand_flash-common, driver.semc, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.nand_flash-common, driver.semc, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="semc"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.nic301.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.nor_flash-common.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.nor_flash-controller-flexspi.condition_id">
      <require condition="allOf.driver.nor_flash-common, driver.flexspi, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.nor_flash-common, driver.flexspi, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.nor_flash-controller-lpspi.condition_id">
      <require condition="allOf.driver.nor_flash-common, driver.lpspi, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.nor_flash-common, driver.lpspi, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.ocotp.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.phy-common.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.phy-device-ksz8081.condition_id">
      <require condition="allOf.driver.phy-common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.driver.phy-common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.pmu.condition_id">
      <require condition="allOf.device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
