RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm7f.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm7f.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.utility.debug_console, driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, driver.common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.utility.debug_console_lite, driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, driver.common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=MIMXRT1062xxxxA, MIMXRT1062xxxxB, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.MIMXRT1062xxxxA, MIMXRT1062xxxxB.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="utility.notifier.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="utility.shell.condition_id">
      <require condition="allOf.utility.str, component.lists, driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="allOf.utility.str, component.lists, driver.common, device=MIMXRT1062.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1062.internal_condition"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1062.internal_condition"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1062" Cversion="1.0.0" condition="DEVICES_Project_Template.MIMXRT1062.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1062</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1062/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1062/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxA.condition_id" category="header" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxA/clock_config.h" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxA.condition_id" category="sourceC" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxA/clock_config.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxA.condition_id" category="header" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxA/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxA.condition_id" category="sourceC" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxA/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxA.condition_id" category="header" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxA/peripherals.h" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxA.condition_id" category="sourceC" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxA/peripherals.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxB.condition_id" category="header" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxB/clock_config.h" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxB.condition_id" category="sourceC" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxB/clock_config.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxB.condition_id" category="header" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxB/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxB.condition_id" category="sourceC" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxB/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxB.condition_id" category="header" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxB/peripherals.h" version="1.0.0" projectpath="board"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxB.condition_id" category="sourceC" attr="config" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxB/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1062/project_template/"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxA.condition_id" category="include" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxA/"/>
        <file condition="allOf.device_ids=MIMXRT1062xxxxB.condition_id" category="include" name="devices/MIMXRT1062/project_template/MIMXRT1062xxxxB/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="RTE_Device.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1062/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1062/template/"/>
      </files>
    </component>
