RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id" Cversion="2.0.1" condition="component.silicon_id.condition_id">
      <description>Driver silicon_id</description>
      <files>
        <file category="sourceC" name="components/silicon_id/fsl_silicon_id.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/fsl_silicon_id.h" projectpath="component/silicon_id"/>
        <file category="include" name="components/silicon_id/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt10xx" Cversion="2.0.0" condition="component.silicon_id_rt10xx.condition_id">
      <description>Driver silicon_id rt10xx</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/rt10xx/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component/silicon_id"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="component.software_crc_adapter.condition_id">
      <description>Component software_crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="component.software_rng_adapter.condition_id">
      <description>Component software_rng_adapter</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h" projectpath="component/rng"/>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c" projectpath="component/rng"/>
        <file category="include" name="components/rng/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="component.trng_adapter.condition_id">
      <description>Component trng_adapter</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h" projectpath="component/rng"/>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c" projectpath="component/rng"/>
        <file category="include" name="components/rng/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config" Cversion="1.0.0" condition="component.wifi_bt_module.config.condition_id">
      <description>Wi-Fi and BT module configs</description>
      <files>
        <file category="header" name="components/wifi_bt_module/incl/wifi_bt_module_config.h" projectpath="component/wifi_bt_module/incl"/>
        <file category="include" name="components/wifi_bt_module/incl/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2DS_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062_header" Cversion="1.0.0" condition="device.MIMXRT1062_CMSIS.condition_id">
      <description>Device MIMXRT1062_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1062/MIMXRT1062.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1062/MIMXRT1062_features.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1062/"/>
      </files>
    </component>
