RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1062_linker" Cversion="1.0.0" condition="device.MIMXRT1062_linker.condition_id">
      <description>Device MIMXRT1062_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/arm/MIMXRT1062xxxxx_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1062/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/arm/MIMXRT1062xxxxx_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1062/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/arm/MIMXRT1062xxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT1062/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/arm/MIMXRT1062xxxxx_sdram.scf" version="1.0.0" projectpath="MIMXRT1062/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/arm/MIMXRT1062xxxxx_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1062/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/gcc/MIMXRT1062xxxxx_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1062/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/gcc/MIMXRT1062xxxxx_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1062/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/gcc/MIMXRT1062xxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT1062/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/gcc/MIMXRT1062xxxxx_sdram.ld" version="1.0.0" projectpath="MIMXRT1062/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/gcc/MIMXRT1062xxxxx_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1062/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/iar/MIMXRT1062xxxxx_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1062/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/iar/MIMXRT1062xxxxx_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1062/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/iar/MIMXRT1062xxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT1062/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/iar/MIMXRT1062xxxxx_sdram.icf" version="1.0.0" projectpath="MIMXRT1062/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1062xxxxA, MIMXRT1062xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1062/iar/MIMXRT1062xxxxx_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1062/iar"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.1.0" condition="device.MIMXRT1062_startup.condition_id">
      <description>Device MIMXRT1062_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1062/iar/startup_MIMXRT1062.s" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1062/gcc/startup_MIMXRT1062.S" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1062/arm/startup_MIMXRT1062.S" version="1.1.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062_system" Cversion="1.0.0" condition="device.MIMXRT1062_system.condition_id">
      <description>Device MIMXRT1062_system</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/system_MIMXRT1062.c" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1062/system_MIMXRT1062.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1062/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_12b1msps_sar" Cversion="2.0.4" condition="driver.adc_12b1msps_sar.condition_id">
      <description>ADC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_adc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_adc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.2.1" condition="driver.adc_etc.condition_id">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_adc_etc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_adc_etc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
