RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aipstz" Cversion="2.0.1" condition="driver.aipstz.condition_id">
      <description>aipstz Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_aipstz.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_aipstz.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bee" Cversion="2.0.2" condition="driver.bee.condition_id">
      <description>BEE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_bee.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_bee.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache" Cversion="2.0.4" condition="driver.cache_armv7_m7.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-mt9m114" Cversion="1.0.2" condition="driver.camera-device-mt9m114.condition_id">
      <description>Driver camera-device-mt9m114</description>
      <files>
        <file category="header" name="components/video/camera/device/mt9m114/fsl_mt9m114.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/mt9m114/fsl_mt9m114.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/mt9m114/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7725" Cversion="1.0.1" condition="driver.camera-device-ov7725.condition_id">
      <description>Driver camera-device-ov7725</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7725/fsl_ov7725.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7725/fsl_ov7725.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7725/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb" Cversion="1.0.1" condition="driver.camera-device-sccb.condition_id">
      <description>Driver camera-device-sccb</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/video/camera/device/sccb/fsl_sccb.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/sccb/fsl_sccb.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/sccb/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-receiver-common" Cversion="1.0.0" condition="driver.camera-receiver-common.condition_id">
      <description>Driver camera-receiver-common</description>
      <files>
        <file category="header" name="components/video/camera/receiver/fsl_camera_receiver.h" projectpath="video"/>
        <file category="include" name="components/video/camera/receiver/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-receiver-csi" Cversion="1.0.2" condition="driver.camera-receiver-csi.condition_id">
      <description>Driver camera-receiver-csi</description>
      <files>
        <file category="header" name="components/video/camera/receiver/csi/fsl_csi_camera_adapter.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/receiver/csi/fsl_csi_camera_adapter.c" projectpath="video"/>
        <file category="include" name="components/video/camera/receiver/csi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.4.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
