RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-elcdif" Cversion="1.0.1" condition="driver.dc-fb-elcdif.condition_id">
      <description>Driver dc-fb-elcdif</description>
      <files>
        <file category="header" name="components/video/display/dc/elcdif/fsl_dc_fb_elcdif.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/elcdif/fsl_dc_fb_elcdif.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/elcdif/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcdc_1" Cversion="2.3.0" condition="driver.dcdc_1.condition_id">
      <description>DCDC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_dcdc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_dcdc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcp" Cversion="2.1.7" condition="driver.dcp.condition_id">
      <description>DCP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_dcp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_dcp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.0" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-common" Cversion="1.0.0" condition="driver.display-common.condition_id">
      <description>Driver display-common</description>
      <files>
        <file category="header" name="components/video/display/fsl_display.h" projectpath="video"/>
        <file category="include" name="components/video/display/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.0" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.3" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="elcdif" Cversion="2.0.6" condition="driver.elcdif.condition_id">
      <description>ELCDIF Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_elcdif.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_elcdif.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enc" Cversion="2.2.1" condition="driver.enc.condition_id">
      <description>ENC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_enc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_enc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enet" Cversion="2.7.1" condition="driver.enet.condition_id">
      <description>ENET Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_enet.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_enet.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ewm" Cversion="2.0.3" condition="driver.ewm.condition_id">
      <description>EWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_ewm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_ewm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan" Cversion="2.11.4" condition="driver.flexcan.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_flexcan.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_flexcan.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan_edma" Cversion="2.11.4" condition="driver.flexcan_edma.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_flexcan_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_flexcan_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
