RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.4.2" condition="driver.lpspi_edma.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.7.6" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.6.0" condition="driver.lpuart_edma.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-common" Cversion="1.0.0" condition="driver.nand_flash-common.condition_id">
      <description>Driver nand_flash-common</description>
      <files>
        <file category="header" name="components/flash/nand/fsl_nand_flash.h" projectpath="nand_flash"/>
        <file category="include" name="components/flash/nand/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-controller-flexspi" Cversion="1.0.0" condition="driver.nand_flash-controller-flexspi.condition_id">
      <description>Driver nand_flash-controller-flexspi</description>
      <files>
        <file category="sourceC" name="components/flash/nand/flexspi/fsl_flexspi_nand_flash.c" projectpath="nand_flash"/>
        <file category="header" name="components/flash/nand/flexspi/fsl_flexspi_nand_flash.h" projectpath="nand_flash"/>
        <file category="include" name="components/flash/nand/flexspi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-controller-semc" Cversion="1.0.0" condition="driver.nand_flash-controller-semc.condition_id">
      <description>Driver nand_flash-controller-semc</description>
      <files>
        <file category="sourceC" name="components/flash/nand/semc/fsl_semc_nand_flash.c" projectpath="nand_flash"/>
        <file category="header" name="components/flash/nand/semc/fsl_semc_nand_flash.h" projectpath="nand_flash"/>
        <file category="include" name="components/flash/nand/semc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nic301" Cversion="2.0.1" condition="driver.nic301.condition_id">
      <description>NIC301 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_nic301.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common" Cversion="1.0.0" condition="driver.nor_flash-common.condition_id">
      <description>Driver nor_flash-common</description>
      <files>
        <file category="header" name="components/flash/nor/fsl_nor_flash.h" projectpath="nor_flash"/>
        <file category="include" name="components/flash/nor/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-controller-flexspi" Cversion="1.0.0" condition="driver.nor_flash-controller-flexspi.condition_id">
      <description>Driver nor_flash-controller-flexspi</description>
      <files>
        <file category="sourceC" name="components/flash/nor/flexspi/fsl_flexspi_nor_flash.c" projectpath="nor_flash"/>
        <file category="header" name="components/flash/nor/flexspi/fsl_flexspi_nor_flash.h" projectpath="nor_flash"/>
        <file category="include" name="components/flash/nor/flexspi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-controller-lpspi" Cversion="1.0.0" condition="driver.nor_flash-controller-lpspi.condition_id">
      <description>Driver nor_flash-controller-lpspi</description>
      <files>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.c" projectpath="nor_flash"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.h" projectpath="nor_flash"/>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.c" projectpath="nor_flash"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.h" projectpath="nor_flash"/>
        <file category="include" name="components/flash/nor/lpspi/"/>
      </files>
    </component>
