RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ocotp" Cversion="2.1.3" condition="driver.ocotp.condition_id">
      <description>OCOTP Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_ocotp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_ocotp.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="header" name="components/pf1550/fsl_pf1550.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550.c" projectpath="pmic_driver"/>
        <file category="header" name="components/pf1550/fsl_pf1550_charger.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550_charger.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="header" name="components/pf3000/fsl_pf3000.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf3000/fsl_pf3000.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common" Cversion="2.0.0" condition="driver.phy-common.condition_id">
      <description>Driver phy-common</description>
      <files>
        <file category="header" name="components/phy/fsl_phy.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ksz8081" Cversion="2.0.0" condition="driver.phy-device-ksz8081.condition_id">
      <description>Driver phy-device-ksz8081</description>
      <files>
        <file category="header" name="components/phy/device/phyksz8081/fsl_phyksz8081.h" projectpath="component/phy"/>
        <file category="sourceC" name="components/phy/device/phyksz8081/fsl_phyksz8081.c" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyksz8081/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pit" Cversion="2.0.4" condition="driver.pit.condition_id">
      <description>PIT Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_pit.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_pit.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmu" Cversion="2.1.1" condition="driver.pmu.condition_id">
      <description>pmu Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_pmu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_pmu.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.8.3" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pxp" Cversion="2.6.1" condition="driver.pxp.condition_id">
      <description>PXP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_pxp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_pxp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qtmr" Cversion="2.2.2" condition="driver.qtmr_1.condition_id">
      <description>QTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_qtmr.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_qtmr.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="1.0.1" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_romapi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_romapi.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file condition="allOf.cores=cm7f.condition_id" category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
