RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtwdog" Cversion="2.1.2" condition="driver.rtwdog.condition_id">
      <description>RTWDOG Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_rtwdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_rtwdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.2" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.0" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="semc" Cversion="2.7.0" condition="driver.semc.condition_id">
      <description>SEMC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_semc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_semc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_hp" Cversion="2.3.2" condition="driver.snvs_hp.condition_id">
      <description>SNVS HP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_snvs_hp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_snvs_hp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_lp" Cversion="2.4.6" condition="driver.snvs_lp.condition_id">
      <description>SNVS LP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_snvs_lp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_snvs_lp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_flexram_allocate" Cversion="2.0.2" condition="driver.soc_flexram_allocate.condition_id">
      <description>SOC FLEXRAM ALLOCATE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_flexram_allocate.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_flexram_allocate.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif" Cversion="2.0.6" condition="driver.spdif.condition_id">
      <description>SPDIF Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_spdif.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_spdif.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif_edma" Cversion="2.0.6" condition="driver.spdif_edma.condition_id">
      <description>SPDIF EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_spdif_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_spdif_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="src" Cversion="2.0.1" condition="driver.src.condition_id">
      <description>SRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_src.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_src.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tempmon" Cversion="2.1.1" condition="driver.tempmon.condition_id">
      <description>TEMPMON Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_tempmon.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_tempmon.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng" Cversion="2.0.15" condition="driver.trng.condition_id">
      <description>TRNG Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_trng.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_trng.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
