RobertRostohar/NXP_Sensor_SDK/packs/MIMXRT1062_DFP/NXP.MIMXRT1062_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsc" Cversion="2.0.3" condition="driver.tsc.condition_id">
      <description>TSC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_tsc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_tsc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sdhc" Cversion="2.8.4" condition="driver.usdhc.condition_id">
      <description>USDHC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_usdhc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_usdhc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-common" Cversion="1.1.0" condition="driver.video-common.condition_id">
      <description>Driver video-common</description>
      <files>
        <file category="header" name="components/video/fsl_video_common.h" projectpath="video"/>
        <file category="sourceC" name="components/video/fsl_video_common.c" projectpath="video"/>
        <file category="include" name="components/video/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c" Cversion="1.0.1" condition="driver.video-i2c.condition_id">
      <description>Driver video-i2c</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/video/i2c/fsl_video_i2c.h" projectpath="video"/>
        <file category="sourceC" name="components/video/i2c/fsl_video_i2c.c" projectpath="video"/>
        <file category="include" name="components/video/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wdog" Cversion="2.2.0" condition="driver.wdog01.condition_id">
      <description>wdog01 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_wdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_wdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904" Cversion="2.5.1" condition="driver.wm8904.condition_id">
      <description>Driver wm8904</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_WM8904_ENABLE
#define CODEC_WM8904_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8904/fsl_wm8904.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8904/fsl_wm8904.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8904/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960" Cversion="2.2.4" condition="driver.wm8960.condition_id">
      <description>Driver wm8960</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_WM8960_ENABLE
#define CODEC_WM8960_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8960/fsl_wm8960.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8960/fsl_wm8960.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8960/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962" Cversion="2.2.0" condition="driver.wm8962.condition_id">
      <description>Driver wm8962</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_WM8962_ENABLE
#define CODEC_WM8962_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8962/fsl_wm8962.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8962/fsl_wm8962.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8962/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xbara" Cversion="2.0.6" condition="driver.xbara.condition_id">
      <description>XBARA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_xbara.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_xbara.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xbarb" Cversion="2.0.2" condition="driver.xbarb.condition_id">
      <description>XBARB Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/drivers/fsl_xbarb.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1062/drivers/fsl_xbarb.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1062/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="2.0.3" condition="driver.xip_device.condition_id">
      <description>XIP Device Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1062/xip/fsl_flexspi_nor_boot.h" projectpath="xip"/>
        <file category="sourceC" name="devices/MIMXRT1062/xip/fsl_flexspi_nor_boot.c" projectpath="xip"/>
        <file category="include" name="devices/MIMXRT1062/xip/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/readme.txt" projectpath="middleware/bm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.</description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MIMXRT1062/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MIMXRT1062/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f.condition_id" category="sourceAsm" name="devices/MIMXRT1062/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1062/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1062/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/debug_console/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/debug_console/fsl_debug_console.h" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/debug_console/fsl_debug_console_conf.h" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1062/utilities/str/"/>
        <file category="include" name="devices/MIMXRT1062/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1062/utilities/str/"/>
        <file category="include" name="devices/MIMXRT1062/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/MIMXRT1062/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <RTE_Components_h>
#ifndef DEBUG_CONSOLE_RX_ENABLE
#define DEBUG_CONSOLE_RX_ENABLE 0
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1062/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1062/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/MIMXRT1062/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1062/utilities/str/"/>
      </files>
    </component>
  </components>
</package>
